// 設定金額（ガチャの作成・編集）を入力時、入力された値が指定範囲外の場合--------------------------------------
$(function(){
    $('.input-gacha-price').blur(function(){
        if($(this).val() == ''){
            $(this).next().text('入力が必要です');
        }else if(!(0 <= $(this).val() && $(this).val() <= 10000)){
            $(this).next().text('0～10000の値を入力してください');
        }else{
            $(this).next().text('');
        }
    });
});
// -------------------------------------------------------------------------------------------------