// シミュレーションで設定金額を入力時、入力された値が指定範囲外の場合--------------------------------------
$(function(){
    $('.input-price').blur(function(){
        if($(this).val() == ''){
            $(this).next().text('入力が必要です');
        }else if(!(0 <= $(this).val() && $(this).val() <= 10000)){
            $(this).next().text('0～10000の値を入力してください');
        }else{
            $(this).next().text('');
        }
    });
});
// -----------------------------------------------------------------------------------

// シミュレーションで最大試行回数を入力時、入力された値が指定範囲外の場合-------------------------------
$(function(){
    $('.input-count').blur(function(){
        if($(this).val() == ''){
            $(this).next().text('入力が必要です');
        }else if(!(0 < $(this).val() && $(this).val() <= 1000)){
            $(this).next().text('1～1000の値を入力してください');
        }else{
            $(this).next().text('');
        }
    });
});
// -----------------------------------------------------------------------------------

// シミュレーションで排出率を入力時、入力された値が指定範囲外の場合-----------------
$(function(){
    $('.input-rate').blur(function(){
        if($(this).val() == ''){
            $(this).next().text('入力が必要です');
        }else if(!(0 < $(this).val() && $(this).val() <= 100)){
            $(this).next().text('1～100の値を入力してください');
        }else{
            $(this).next().text('');
        }
    });
});
// --------------------------------------------------------------------------------------